artillery/protomaps-test.yaml
config:
  target: https://d1wzlzgah5gfol.cloudfront.net
  http:
    # Responses have to be sent within 10 seconds, or an `ETIMEDOUT` error gets raised.
    timeout: 10
  phases:
    - duration: 30
      arrivalCount: 90
      name: Startup
    - duration: 30
      arrivalCount: 270
      name: NinePerSecond

  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
    fake-data: {}
  apdex:
    threshold: 800
  ensure:
    thresholds:
      - http.response_time.p99: 10000
      - http.response_time.p95: 20000
scenarios:
  - flow:
      - loop:
          - get:
              url: '/protomaps/15/{{ $randomNumber(15920, 16160) }}/{{ $randomNumber(9980, 10360 ) }}.mvt'
        count: 1